; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-3-3)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	s0 - location
	s1 - location
	s2 - location
	p0-1 - location
	p0-2 - location
	p1-0 - location
	p2-0 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s0)
	(at driver3 s1)
	(at driver4 s0)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s0)
	(empty truck2)
	(at truck3 s0)
	(empty truck3)
	(at package1 s0)
	(at package2 s2)
	(at package3 s0)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 75)
	(= (time-to-walk p0-1 s0) 75)
	(= (time-to-walk s1 p0-1) 34)
	(= (time-to-walk p0-1 s1) 34)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 81)
	(= (time-to-walk p0-2 s0) 81)
	(= (time-to-walk s2 p0-2) 22)
	(= (time-to-walk p0-2 s2) 22)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 54)
	(= (time-to-drive s1 s0) 54)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 40)
	(= (time-to-drive s2 s1) 40)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 97)
	(= (time-to-drive s0 s2) 97)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s1)
	(at driver2 s1)
	(at driver3 s1)
	(at truck1 s0)
	(at truck2 s2)
	(at truck3 s0)
	(at package1 s1)
	(at package2 s2)
	(at package3 s2)
	))

(:metric minimize (+ (+ (* 1  (total-time)) (* 4  (driven))) (* 2  (walked))))

)

; plan
1. (board-truck driver4 truck2 s0)
   deleted: (at driver4 s0) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 4 of 9
2. (walk driver2 s0 p0-1)
   deleted: (at driver2 s0)
   added: (at driver2 p0-1)
   changed: (walked) from 0 to 75
   goals met: 4 of 9
3. (walk driver2 p0-1 s1)
   deleted: (at driver2 p0-1)
   added: (at driver2 s1)
   changed: (walked) from 75 to 109
   goals met: 5 of 9
4. (load-truck package1 truck2 s0)
   deleted: (at package1 s0)
   added: (in package1 truck2)
   goals met: 5 of 9
5. (load-truck package3 truck2 s0)
   deleted: (at package3 s0)
   added: (in package3 truck2)
   goals met: 5 of 9
6. (drive-truck truck2 s0 s2 driver4)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   changed: (driven) from 0 to 97
   goals met: 6 of 9
7. (unload-truck package3 truck2 s2)
   deleted: (in package3 truck2)
   added: (at package3 s2)
   goals met: 7 of 9
8. (drive-truck truck2 s2 s1 driver4)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (driven) from 97 to 137
   goals met: 6 of 9
9. (unload-truck package1 truck2 s1)
   deleted: (in package1 truck2)
   added: (at package1 s1)
   goals met: 7 of 9
10. (drive-truck truck2 s1 s2 driver4)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (driven) from 137 to 177
   goals met: 8 of 9
11. (disembark-truck driver4 truck2 s2)
   deleted: (driving driver4 truck2)
   added: (at driver4 s2) (empty truck2)
   goals met: 8 of 9
12. (board-truck driver4 truck1 s2)
   deleted: (at driver4 s2) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 8 of 9
13. (drive-truck truck1 s2 s0 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (driven) from 177 to 274
   goals met: 9 of 9
